# Insert Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelCurveArrArray..::..Insert Method
ModelCurveArrArray Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Insert(
	ModelCurveArray item,
	int index
)
```

Visual Basic
---
```text
Public Overridable Sub Insert ( _
	item As ModelCurveArray, _
	index As Integer _
)
```

Visual C++
---
```text
public:
virtual void Insert(
	ModelCurveArray^ item,
	int index
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ModelCurveArray
index
    Type: System..::..Int32
# See Also
ModelCurveArrArray Class
Autodesk.Revit.DB Namespace